; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-11)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 room6 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(room room6)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 roomb)
(at ball4 room3)
(at ball5 room3)
(at ball6 room4)
(at ball7 room4)
(at ball8 room4)
(at ball9 room4)
(at ball10 room5)
(at ball11 room6)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
)
)
)

; plan
1. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 2 of 11
2. (pick ball3 roomb left)
   deleted: (at ball3 roomb) (free left)
   added: (carry ball3 left)
   goals met: 2 of 11
3. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 2 of 11
4. (pick ball11 room6 right)
   deleted: (at ball11 room6) (free right)
   added: (carry ball11 right)
   goals met: 2 of 11
5. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 2 of 11
6. (move room5 rooma)
   deleted: (at-robby room5)
   added: (at-robby rooma)
   goals met: 2 of 11
7. (drop ball11 rooma right)
   deleted: (carry ball11 right)
   added: (at ball11 rooma) (free right)
   goals met: 3 of 11
8. (drop ball3 rooma left)
   deleted: (carry ball3 left)
   added: (at ball3 rooma) (free left)
   goals met: 4 of 11
9. (move rooma room5)
   deleted: (at-robby rooma)
   added: (at-robby room5)
   goals met: 4 of 11
10. (pick ball10 room5 left)
   deleted: (at ball10 room5) (free left)
   added: (carry ball10 left)
   goals met: 4 of 11
11. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 4 of 11
12. (pick ball9 room4 right)
   deleted: (at ball9 room4) (free right)
   added: (carry ball9 right)
   goals met: 4 of 11
13. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 4 of 11
14. (drop ball9 rooma right)
   deleted: (carry ball9 right)
   added: (at ball9 rooma) (free right)
   goals met: 5 of 11
15. (drop ball10 rooma left)
   deleted: (carry ball10 left)
   added: (at ball10 rooma) (free left)
   goals met: 6 of 11
16. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 6 of 11
17. (pick ball8 room4 left)
   deleted: (at ball8 room4) (free left)
   added: (carry ball8 left)
   goals met: 6 of 11
18. (pick ball7 room4 right)
   deleted: (at ball7 room4) (free right)
   added: (carry ball7 right)
   goals met: 6 of 11
19. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 6 of 11
20. (drop ball7 rooma right)
   deleted: (carry ball7 right)
   added: (at ball7 rooma) (free right)
   goals met: 7 of 11
21. (drop ball8 rooma left)
   deleted: (carry ball8 left)
   added: (at ball8 rooma) (free left)
   goals met: 8 of 11
22. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 8 of 11
23. (pick ball6 room4 left)
   deleted: (at ball6 room4) (free left)
   added: (carry ball6 left)
   goals met: 8 of 11
24. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 8 of 11
25. (pick ball5 room3 right)
   deleted: (at ball5 room3) (free right)
   added: (carry ball5 right)
   goals met: 8 of 11
26. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 8 of 11
27. (drop ball5 rooma right)
   deleted: (carry ball5 right)
   added: (at ball5 rooma) (free right)
   goals met: 9 of 11
28. (drop ball6 rooma left)
   deleted: (carry ball6 left)
   added: (at ball6 rooma) (free left)
   goals met: 10 of 11
29. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 10 of 11
30. (pick ball4 room3 left)
   deleted: (at ball4 room3) (free left)
   added: (carry ball4 left)
   goals met: 10 of 11
31. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 10 of 11
32. (drop ball4 rooma left)
   deleted: (carry ball4 left)
   added: (at ball4 rooma) (free left)
   goals met: 11 of 11
